# Rebar Bend Data Class

Source: https://www.revitapidocs.com/2026/027b5619-ad82-74b3-1d78-efe86a1ef96b.htm

---

| Rebar Bend Data Class |
| --- |

The values in this class provide a summary of information taken from the RebarBarType, RebarHookType, and RebarStyle. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Structure RebarBendData

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class RebarBendData : IDisposable
```

```
Public Class RebarBendData
	Implements IDisposable
```

```
public ref class RebarBendData : IDisposable
```

```
type RebarBendData =
    class
        interface IDisposable
    end
```
The RebarBendData type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | RebarBendData | Constructs a new RebarBendData with default settings. |
|  | RebarBendData(RebarBarType, RebarStyle, BarTerminationsData) | Constructs a new RebarBendData using the bar type, style and termination's values. |
|  | RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) | **Obsolete.** Constructs a new RebarBendData using the bar type, hook types, style and orientation values. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | BarModelDiameter | Defines the model diameter of the bar.  The default value is 0\.0\.  When this is changed, the CrankStraightLength0, CrankStraightLength1, CrankAnledLength0, CrankAnledLength1 will be recomputed. |
|  | BarNominalDiameter | Defines the nominal diameter of the bar.  The default value is 0\.0\. |
|  | BendRadius | The radius of all fillets, except hook fillets, in the Rebar shape.  The default value is 0\.0\. |
|  | CrankAngledLength0 | Identifies the crank angled length at the start. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankAngledLength1 | Identifies the crank angled length at the end. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankLength0 | Identifies the crank length at the start. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankLength1 | Identifies the crank length at the end. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankOffsetLength0 | Identifies the crank offset length at the start. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankOffsetLength1 | Identifies the crank offset length at the end. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankRatio0 | Identifies the crank ratio at the start. The 1:crankRatio that defines the crank slope. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankRatio1 | Identifies the crank ratio at the end. The 1:crankRatio that defines the crank slope. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankStraightLength0 | Identifies the crank straight length at the start. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | CrankStraightLength1 | Identifies the crank straight length at the end. The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values. |
|  | HookAngle0 | The angle (in degrees) of the hook at the start. Must be at least 0 and no more than 180\. If the value is 0 it means that there is no hook.  The default value is 0\. When setting from 0 to another value, all crank lengths for start will be set to 0\.  When setting this value to 0 HookLength0 will be set to 0\. |
|  | HookAngle1 | The angle (in degrees) of the hook at the end. Must be at least 0 and no more than 180\. If the value is 0 it means that there is no hook.  The default value is 0\. When setting from 0 to another value all crank lengths for end will be set to 0\.  When setting this value to 0 HookLength1 will be set to 0\. |
|  | HookBendRadius | The radius of the hook fillets in the Rebar shape.  The default value is 0\.0\. |
|  | HookLength0 | The extension length of the hook at the start.  The default value is 0\.0\. |
|  | HookLength1 | The extension length of the hook at the end.  The default value is 0\.0\. |
|  | HookOrient0 | **Obsolete.** Identifies the orientation of the termination (e.g. hook, crank) at the start.  The default value is RebarTerminationOrientation::Left. |
|  | HookOrient1 | **Obsolete.** Identifies the orientation of the termination (e.g. hook, crank) at the end.  The default value is RebarTerminationOrientation::Left. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TerminationOrientation0 | Identifies he orientation of the termination (e.g. hook, crank) at the start.  The default value is RebarTerminationOrientation::Left. |
|  | TerminationOrientation1 | Identifies the orientation of the termination (e.g. hook, crank) at the end.  The default value is RebarTerminationOrientation::Left. |
|  | TerminationRotationAngle0 | Identifies the termination's rotation angle (in radians) at the start.  The default value is 0\.0 |
|  | TerminationRotationAngle1 | Identifies he termination's rotation angle (in radians) at the end.  The default value is 0\.0 |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarBendData |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace